{"ideaGroups":[{"name":"aristocracy_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"leader_siege":"1","nobles_loyalty_modifier":"0.1"}},{"name":"noble_knights","bonuses":{"cavalry_power":"0.10","cavalry_cost":"-0.10"},"localizedName":"Noble Knights","localizedDesc":"Supporting cavalry requires an economic system that produces a large number of surplus horses. If we were to guarantee the privileges of our noble class not only would they be much happier they would do much of the work to produce the needed horses. Our court fool described it as service guarantees serfs."},{"name":"military_traditions","bonuses":{"mil_tech_cost_modifier":"-0.1"},"localizedName":"Military Traditions","localizedDesc":"Military thought is constantly evolving and we ensure that our military thought evolves with it. By encouraging a tradition of service amongst our nobility, to be a man of status is to be a man who has won glory on the battlefield. Although bravery and stuff like that is always useful, there is nothing quite like outclassing your enemy to make it easy."},{"name":"local_nobility","bonuses":{"global_autonomy":"-0.025","yearly_absolutism":"0.5"},"localizedName":"Local Nobility","localizedDesc":"The nobility know they are simply better than normal people and will give their loyalty to those that are worthy. If we confirm their privileges, they will of course remember our largess and be more resistant to the inducements of foreign powers."},{"name":"serfdom","bonuses":{"global_manpower_modifier":"0.33"},"localizedName":"Serfdom","localizedDesc":"A foot soldier in the army is not quite the career that anyone wanted, what with the poor food, low pay, and virtually nonexistent medical services. If we were to tie our peasants to the land we would know exactly where to look for recruits."},{"name":"noble_officers","bonuses":{"army_tradition_decay":"-0.01","navy_tradition_decay":"-0.01"},"localizedName":"Noble Officers","localizedDesc":"Who leads our troops is an important choice. Our nobility is seeking to ensure that preference is given to them. It will give them a chance to show their valor by giving the enemy cold steel and we will allow them to do this."},{"name":"international_nobility","bonuses":{"diplomats":"1","free_leader_pool":"1"},"localizedName":"International Nobility","localizedDesc":"International relations are a tricky business. Some say that the merchant class who are used to dealing with foreigners are best for this. Those who say this ignore the kindred ties that our noble families have established through the years, these ties should be taken advantage of to help our cause diplomatically."},{"name":"noble_resilience","bonuses":{"mercenary_manpower":"0.20"},"localizedName":"Noble Connections","localizedDesc":"The various mercenary groups of this continent are often headed by lesser nobles. By befriending the nobility, we can make use of their network of contacts to seek out more and larger groups of mercenary soldiers."}],"trigger":{"conditions":[],"conditionSets":[{"composeOr":true,"modifierNot":false,"conditions":[{"name":"has_government_attribute","value":"enables_aristocratic_idea_group"},{"name":"government","value":"tribal"}],"conditionSets":[{"composeOr":false,"modifierNot":false,"conditions":[{"name":"government","value":"theocracy"}],"conditionSets":[{"composeOr":false,"modifierNot":true,"conditions":[{"name":"religion_group","value":"christian"}],"conditionSets":[]}]}]},{"composeOr":false,"modifierNot":true,"conditions":[{"name":"has_reform","value":"steppe_horde"}],"conditionSets":[]}]},"localizedName":"Aristocratic Ideas"},{"name":"plutocracy_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"global_institution_spread":"0.10","burghers_loyalty_modifier":"0.1","vaisyas_loyalty_modifier":"0.1"}},{"name":"tradition_of_payment","bonuses":{"mercenary_manpower":"0.10","mercenary_discipline":"0.025"},"localizedName":"Tradition of Payment","localizedDesc":"There is always the temptation to be just a few days late with payments to mercenaries, after all you never know what sudden expenses might come along. We will not do that, we will pay our mercenaries exactly on time and mercenary captains will know this and remember this."},{"name":"abolished_serfdom","bonuses":{"land_morale":"0.10"},"localizedName":"Abolished Serfdom","localizedDesc":"We know from reading the accounts of Roman times that a citizen army of free men is far more willing to fight than those who are forced. We must make our peasantry fairly free and they will fight to defend their freedom."},{"name":"bill_of_rights","bonuses":{"global_unrest":"-2"},"localizedName":"Bill of Rights","localizedDesc":"By granting the citizens certain fundamental rights, we reduce the likelihood of a peasant uprising."},{"name":"free_merchants","bonuses":{"merchants":"1"},"localizedName":"You have $NUMBER$ unassigned merchants.","localizedDesc":"In more reactionary and hidebound societies men of trade are looked down upon as somehow being lesser men than those who own land. Well not for us, we know that wealth is power regardless of where it comes from."},{"name":"free_subjects","bonuses":{"global_trade_goods_size_modifier":"0.1"},"localizedName":"Free Subjects","localizedDesc":"Although giving a servant a damn good thrashing might be satisfying, it is not the best way to actually get them to work harder. Some natural philosopher has hit on the idea of making profit the prime motivation for people, if we replace monetary rents with payment in kind, our peasants will be incentivized to produce more."},{"name":"free_cities","bonuses":{"caravan_power":"0.25"},"localizedName":"Free Cities","localizedDesc":"Giving our cities self-governance in matters of trade will allow us to open new, profitable trade routes."},{"name":"emancipation","bonuses":{"manpower_recovery_speed":"0.2"},"localizedName":"Emancipation","localizedDesc":"For a long time we have restricted ownership of land to only those we felt were trustworthy enough. If we were to lift these restrictions, then land holding would be consolidated. This in turn would create a pool of seasonal labor for whom the army life might be worth pursuing."}],"trigger":{"conditions":[{"name":"has_government_attribute","value":"enables_plutocratic_idea_group"}],"conditionSets":[]},"localizedName":"Plutocratic Ideas"},{"name":"horde_gov_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"cavalry_power":"0.25"}},{"name":"horse_lords","bonuses":{"cavalry_cost":"-0.33"},"localizedName":"Horse-lords of the Steppes","localizedDesc":"The only true beast is of human nature. Horses have been born and raised among our children, and they have learned to be as noble and as ferocious as our own people. We recognize their harsh taming as our greatest pride, and they recognize us as their greatest lords."},{"name":"beyond_the_sun","bonuses":{"ae_impact":"-0.1"},"localizedName":"Beyond the Sun","localizedDesc":"The age of the Great Hordes is not over yet. We have learned from the mistakes of our enemies and will now rise wiser, stronger. All the land where the sun lives and dies must be ours."},{"name":"mandate_of_the_khan","bonuses":{"religious_unity":"0.25"},"localizedName":"Mandate of the Khan","localizedDesc":"As the khan commands, gods do. The unity of our people comes from the loyalty to our great leader. Only a man capable of bending the golden metal lying under a bleeding crown is worthy of our devotion."},{"name":"there_shall_be_no_grass","bonuses":{"land_attrition":"-0.2"},"localizedName":"There Shall Be No Grass","localizedDesc":"There, where our horde has passed, the grass will never grow again, the land will no longer feed our enemies, day and night will pass and the ground will stay silent, no crops to be recolected. Some hungers you cannot escape."},{"name":"horde_loyalty","bonuses":{"global_unrest":"-1"},"localizedName":"Horde Loyalty","localizedDesc":"The loyalty of our people is unquestionable. No soul who has lived under the thriving rule of the khan would think of ever leaving it."},{"name":"watchers_of_the_silk_road","bonuses":{"caravan_power":"0.20"},"localizedName":"Watchers of the Silk Road","localizedDesc":"We do not build, we do not trade. We take what we need... and sometimes more. Our warriors have kept an attentive watch upon foreign merchants and their techniques, and we now know the safest paths to transport our goods."},{"name":"a_magnanimous_empire","bonuses":{"num_accepted_cultures":"2"},"localizedName":"A Magnanimous Empire","localizedDesc":"The prosperous reign of the Great Khan was not only known for his fearful sword, but also for his exceptional piety towards those who wisely bended the knee to him. Those who welcome our tolerant empire shall be treated as part of it."}],"trigger":{"conditions":[{"name":"has_reform","value":"steppe_horde"}],"conditionSets":[]},"localizedName":"Horde Government Ideas "},{"name":"theocracy_gov_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"global_heretic_missionary_strength":"0.01","church_loyalty_modifier":"0.1","brahmins_hindu_loyalty_modifier":"0.1","brahmins_muslim_loyalty_modifier":"0.1"}},{"name":"servants_of_god","bonuses":{"devotion":"1"},"localizedName":"Servants of God","localizedDesc":"Being a cog in this heavenly machinery is one of the greatest honors that a man can ever bear. Having our own god as Lord makes the heart of our people beat with thunderous acclaim."},{"name":"by_the_grace_of_god","bonuses":{"fire_damage_received":"-0.1"},"localizedName":"By the Grace of God","localizedDesc":"The world was created with flames and with flames we shall all end. Our god has gifted the fire of life to us, humble mortals, burning our souls in the process and making us see the truth of its danger. Thou shall not be afraid."},{"name":"friends_in_high_places","bonuses":{"leader_cost":"-0.2"},"localizedName":"Friends in High Places","localizedDesc":"There is only one path that will lead us to undying, everlasting happiness. To know god is to know his closest agents here on Earth. They will help us find that path."},{"name":"flesh_is_weak","bonuses":{"land_morale":"0.1"},"localizedName":"Flesh Is Weak","localizedDesc":"The flesh is weak, the soul is not. Our armies have learned to fight as if they shared the same soul, and thus their morale shall never be broken."},{"name":"alpha_and_omega","bonuses":{"enforce_religion_cost":"-0.1","culture_conversion_cost":"-0.1"},"localizedName":"Alpha and Omega","localizedDesc":"Our god is the beginning and end of all things. His voice shall be the only sound that our enemies will hear above the screams of the battle. His pious nature will lead them into his welcoming arms. Then, they shall see the truth."},{"name":"conviction_of_sin","bonuses":{"global_unrest":"-2"},"localizedName":"Conviction of Sin","localizedDesc":"They will kneel, those who have done wrong. The heavy weight of their wicked acts will haunt them forevermore. They shall not sleep soundly until they have atoned for the devious nightmares that they have caused."},{"name":"martyrs","bonuses":{"global_manpower_modifier":"0.15"},"localizedName":"Martyrs","localizedDesc":"A martyr is someone who understands that dying in behalf of their god is the highest of honors. The people of our land keep their faith close to their hearts and are always keen to join our cause."}],"trigger":{"conditions":[{"name":"government","value":"theocracy"}],"conditionSets":[]},"localizedName":"Divine Ideas"},{"name":"indigenous_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"global_institution_spread":"0.25"}},{"name":"indigenous_bountiful_land","bonuses":{"tribal_development_growth":"0.05","development_cost":"-0.05"},"localizedName":"Bountiful Land","localizedDesc":"Our people are surrounded by vast amounts of land, untouched by humans for generations and thick with flora or fauna."},{"name":"indigenous_irregular_warfare","bonuses":{"hostile_attrition":"1"},"localizedName":"Irregular Warfare","localizedDesc":"Through the use of natural features and barriers we are accustmed to we can defeat larger enemies through raids and ambushes."},{"name":"indigenous_constitution","bonuses":{"monthly_reform_progress_modifier":"0.25"},"localizedName":"The Great Law","localizedDesc":"By binding our people together through a set of common principles, a constitution, we can strive towards the betterment of us all."},{"name":"indigenous_braves","bonuses":{"land_morale":"0.10"},"localizedName":"Braves","localizedDesc":"Our culture has had a long tradition of rites of passages for young men to become warriors. An act of bravery to complete the journey to adulthood."},{"name":"indigenous_controlled_burns","bonuses":{"global_manpower_modifier":"0.2"},"localizedName":"Controlled Burns","localizedDesc":"By burning fields in a controlled manner we can get greater yields of our harvests, allowing us a much greater population."},{"name":"indigenous_trade_with_foreigners","bonuses":{"idea_cost":"-0.1"},"localizedName":"Trade with Foreigners","localizedDesc":"By trading with people of other cultures and far away places we will be exposed to new ideas."},{"name":"indigenous_treaties","bonuses":{"province_warscore_cost":"-0.2"},"localizedName":"Treaties Kept","localizedDesc":"Our word is our bond, it would be unthinkable for us to break any treaty we've made. As such there is a trust put to us as hostilities cease."}],"trigger":{"conditions":[{"name":"has_government_attribute","value":"enables_natives_idea_group"}],"conditionSets":[]},"localizedName":"Indigenous Ideas"},{"name":"innovativeness_ideas","category":"ADM","ideas":[{"name":"bonus","bonuses":{"advisor_cost":"-0.25"}},{"name":"patron_of_art","bonuses":{"prestige_decay":"-0.01"},"localizedName":"Patron of the Arts","localizedDesc":"Our quest towards a culturally cultivated society begins here. Our artistic wonders will go down in history as the most marvelous of this era."},{"name":"empiricism","bonuses":{"innovativeness_gain":"0.5"},"localizedName":"Empiricism","localizedDesc":"With the search of knowledge also comes many false ideas. It is only with evidence and our experience of the world around us that we can prove or disprove that what is before us is in fact true."},{"name":"scientific_revolution","bonuses":{"technology_cost":"-0.1","embracement_cost":"-0.1"},"localizedName":"Scientific Revolution","localizedDesc":"We should strive towards a social and economic revolution marked by technological inventions and a transfer from an agricultural society into an industrial one."},{"name":"dynamic_court","bonuses":{"advisor_pool":"1"},"localizedName":"Dynamic Court","localizedDesc":"A truly innovative court is one where any person may rise to shine. We must strive to make sure that old traditions, birth or wealth aren't a hindrance to the development of our court or a barrier to talented people wishing to seek their fortune in the service of our state."},{"name":"print_culture","bonuses":{"global_institution_spread":"0.25"},"localizedName":"Print Culture","localizedDesc":"It is by exchange of ideas that we advance as a society. The words of our generations greatest minds must be written down and shared with their peers."},{"name":"optimism","bonuses":{"war_exhaustion":"-0.05"},"localizedName":"Optimism","localizedDesc":"Victory is not just won off the battlefield but also in the drawing rooms. Our advancement of reason makes our people able to shrug off the effects of temporary setbacks and prepare instead for our inevitable victory."},{"name":"formalized_officer_corps","bonuses":{"free_leader_pool":"1"},"localizedName":"Formalized Officer Corps","localizedDesc":"Traditionally officers come from the nobility, but we don't have that many nobles leading to a shortage of officers. However, there are actually plenty of persons of lower class in our armies. We should consider promoting some of them as professional officers."}],"localizedName":"Innovative Ideas"},{"name":"religious_ideas","category":"ADM","ideas":[{"name":"bonus","bonuses":{"culture_conversion_cost":"-0.25","brahmins_hindu_loyalty_modifier":"0.1","church_loyalty_modifier":"0.1"}},{"name":"missionary_schools","bonuses":{"missionaries":"1"},"localizedName":"Missionary Schools","localizedDesc":"Although there is no shortage of people ready to go out and spread the true faith, most of these people simply do more harm than good. However, specialist schools to train the missionaries will ensure we have more people who cannot only spread the faith, but succeed as well."},{"name":"church_attendance_duty","bonuses":{"stability_cost_modifier":"-0.25"},"localizedName":"Church Attendance Duty","localizedDesc":"By adopting a mandatory church attendance policy, the emphasis on religious values and beliefs will unquestionably minimize the costs of maintaining law and order."},{"name":"divine_supremacy","bonuses":{"global_missionary_strength":"0.03"},"localizedName":"Divine Supremacy","localizedDesc":"It is of the utmost importance that we rid our nation and its surrounding borders from the infidels pestering our lands."},{"name":"devoutness","bonuses":{"tolerance_own":"2","papal_influence":"2","devotion":"0.5","monthly_fervor_increase":"0.25","church_power_modifier":"0.1"},"localizedName":"Devoutness","localizedDesc":"Religion is one of the most important bulwarks of our rulership. By public displays of piety by the rulers, the ruled will follow suit. The growing of piety amongst our people will strengthen our rule."},{"name":"religious_tradition","bonuses":{"prestige":"1"},"localizedName":"Religious Tradition","localizedDesc":"The strength of our faith and public displays of piety and worship are admired by other lands both near and far. This is reflected in the prestige and glory to our realm."},{"name":"inquisition","bonuses":{"missionary_maintenance_cost":"-0.5"},"localizedName":"Inquisition","localizedDesc":"Establish a state-sanctioned Inquisition to maintain the religious purity of our populace by rooting out heretics and blasphemers."},{"name":"deus_vult","bonuses":{"cb_on_religious_enemies":"yes"},"localizedName":"Deus Vult","localizedDesc":"Join the battle cry of the crusades, 'God wills it' and crush the infidels."}],"localizedName":"Religious Ideas"},{"name":"spy_ideas","category":"DIP","ideas":[{"name":"bonus","bonuses":{"rebel_support_efficiency":"0.50"}},{"name":"efficient_spies","bonuses":{"spy_offence":"0.5","advisor_cost":"-0.10"},"localizedName":"Efficient Spies","localizedDesc":"Most peasants will sell their own mother for cash but find those who can do something truly useful is more difficult. Through experience we are learning to separate the wheat from the chaff."},{"name":"agent_training","bonuses":{"diplomats":"1"},"localizedName":"Agent Training","localizedDesc":"We have many covert operations planned but lack the men for the tasks. Establishing a training method for our spies will help bolster the available agents for dangerous missions."},{"name":"vetting","bonuses":{"global_spy_defence":"0.33"},"localizedName":"Vetting","localizedDesc":"With so many offices for profit, we sometimes find that those who run our administration are susceptible to bribes from foreign powers. A few simple background checks will weed out the most prone to corruption."},{"name":"state_propaganda","bonuses":{"ae_impact":"-0.2"},"localizedName":"State Propaganda","localizedDesc":"As with a man, a nation's reputation is everything, and the establishment of an official propaganda service will ensure our good name is not smeared by the lies of our enemies."},{"name":"claim_fabrication","bonuses":{"fabricate_claims_cost":"-0.25","can_fabricate_for_vassals":"yes"},"localizedName":"Claim Fabrication","localizedDesc":"Claiming something as yours is easy, persuading everyone else that you have a valid claim is much harder. By spreading our diplomatic net wide, we can ensure that the people who matter know that this claim is ours."},{"name":"privateers","bonuses":{"embargo_efficiency":"0.25","privateer_efficiency":"0.33"},"localizedName":"Privateers","localizedDesc":"Waging war on enemy commerce rests on the apex of the first triad of victory. We will encourage crusty sea captains to strike at the enemy's trade."},{"name":"audit_checks","bonuses":{"yearly_corruption":"-0.1"},"localizedName":"Audit Checks","localizedDesc":"While we look to infiltrate other nations, we must be vigilant of poisonous ideas spreading around our own courts. Assembling an audit team to ensure our ministers are acting in the state's interest will help root out some rotten elements."}],"localizedName":"Espionage Ideas"},{"name":"diplomatic_ideas","category":"DIP","ideas":[{"name":"bonus","bonuses":{"reduced_stab_impacts":"yes"}},{"name":"foreign_embassies","bonuses":{"diplomats":"1"},"localizedName":"Foreign Embassies","localizedDesc":"Diplomacy is a delicate art of trying to balance several sides at the same time. If we maintain embassies in other countries reporting to us on a regular basis then we will have the information needed in order to ponder our options."},{"name":"cabinet","bonuses":{"diplomatic_upkeep":"1"},"localizedName":"Cabinet","localizedDesc":"By establishing an executive council, we are able to assemble our most skilled diplomats."},{"name":"grand_banquets","bonuses":{"diplomats":"1"},"localizedName":"Grand Banquets","localizedDesc":"Foreign dignitaries love the opportunity to partake in high society and the festivities that come with it. The grandeur of our society is known far and wide."},{"name":"benign_diplomats","bonuses":{"improve_relation_modifier":"0.25"},"localizedName":"Benign Diplomats","localizedDesc":"By being more careful in selecting and educating our diplomats, we will greatly increase our chance to exert our influence and establish a favorable position in other countries."},{"name":"experienced_diplomats","bonuses":{"diplomatic_reputation":"2"},"localizedName":"Experienced Diplomats","localizedDesc":"Sometimes it is simply enough for people to believe that we are powerful. We have worked hard on our diplomatic service to ensure that our word carries extra weight."},{"name":"flexible_negotiation","bonuses":{"province_warscore_cost":"-0.2"},"localizedName":"Flexible Negotiation","localizedDesc":"You can never quite know what can be gained at the peace table so we should enter the with all options open."},{"name":"diplomatic_corps","bonuses":{"dip_tech_cost_modifier":"-0.1"},"localizedName":"Diplomatic Corps","localizedDesc":"Through the establishment of a professional Diplomatic Corps we ensure that the hard-learned lessons of senior diplomats are passed on to the younger generation."}],"localizedName":"Diplomatic Ideas"},{"name":"offensive_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"recover_army_morale_speed":"0.05"}},{"name":"bayonet_leaders","bonuses":{"leader_land_shock":"1"},"localizedName":"Bayonet Leaders","localizedDesc":"Men who are well led will follow, so we will ensure that our officers will lead from the front."},{"name":"national_conscripts","bonuses":{"global_regiment_recruit_speed":"-0.1"},"localizedName":"National Conscripts","localizedDesc":"Increases our military numbers by making it compulsory for men to enroll for military service."},{"name":"superior_firepower","bonuses":{"leader_land_fire":"1"},"localizedName":"Superior Firepower","localizedDesc":"The use of massed firepower to disrupt the enemy before delivering the coup de grace is one of our army's strength and we will ensure that our leaders know this."},{"name":"glorious_arms","bonuses":{"prestige_from_land":"1.0"},"localizedName":"Glorious Arms","localizedDesc":"The sight of our glorious and prestigious army will make all adversaries tremble in fear."},{"name":"engineer_corps","bonuses":{"siege_ability":"0.20"},"localizedName":"Engineer Corps","localizedDesc":"Allows us to gather the greatest minds our nation has to offer in the area of military technology and make use of their unrivalled services."},{"name":"grand_army","bonuses":{"land_forcelimit_modifier":"0.2"},"localizedName":"Grand Army","localizedDesc":"Allows us to create one of the largest and most powerful armies the world has ever seen."},{"name":"napoleonic_warfare","bonuses":{"discipline":"0.05"},"localizedName":"Esprit de Corps","localizedDesc":"Traditional armies relied on furious discipline to maintain order in the ranks, however, by appealing to unit pride we can reach even higher levels of discipline."}],"localizedName":"Offensive Ideas"},{"name":"defensive_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"hostile_attrition":"1"}},{"name":"battlefield_commisions","bonuses":{"army_tradition_from_battle":"1.0"},"localizedName":"Battlefield Commissions","localizedDesc":"Allows us to focus heavily on military advancements and thereby increase our Army Tradition."},{"name":"military_drill","bonuses":{"land_morale":"0.15"},"localizedName":"Military Drill","localizedDesc":"Allows us to invest in military training and thereby improve battle formations, weapon handling and boost the morale of our army."},{"name":"improved_manuever","bonuses":{"leader_land_manuever":"1"},"localizedName":"Improved Maneuver","localizedDesc":"Using troops on the battlefield is a vital skill for a good commander. The ability to know where to move troops will give us an edge."},{"name":"regimental_system","bonuses":{"land_maintenance_modifier":"-0.05"},"localizedName":"Regimental System","localizedDesc":"By organizing our armies into regiments tied to distinct geographical areas we can allow the army to put down roots into the community. Thus when we come to raise more battalions for our regiments they will be able to be recruited faster."},{"name":"defensive_mentality","bonuses":{"defensiveness":"0.2","fort_maintenance_modifier":"-0.1"},"localizedName":"Defensive Mentality","localizedDesc":"There are those who think that attack is the best form of defense, but that is foolish let them come to us and then hit them on the counter. Our troops will defend tenaciously and our fortresses will hold out for longer."},{"name":"supply_trains","bonuses":{"reinforce_speed":"0.33"},"localizedName":"Supply Trains","localizedDesc":"While on campaign attrition is our biggest enemy, the key thing then is to get men to replace these losses as quickly as possible."},{"name":"improved_foraging","bonuses":{"land_attrition":"-0.25"},"localizedName":"Improved Foraging","localizedDesc":"Traditionally we were unable to fight effectively in lands which did not supply a lot of food. However our troops have become better at acquiring food allowing larger armies to fight."}],"localizedName":"Defensive Ideas"},{"name":"trade_ideas","category":"DIP","ideas":[{"name":"bonus","bonuses":{"merchants":"1"}},{"name":"shrewd_commerce_practise","bonuses":{"global_trade_power":"0.2"},"localizedName":"Shrewd Commerce Practice","localizedDesc":"Allows us to make use of more refined trading practices giving our merchants the upper hand over our competitors."},{"name":"free_trade","bonuses":{"merchants":"1"},"localizedName":"Free Trade","localizedDesc":"The current merchant families are seeking to ensure that trade privileges remain their exclusive preserve, but we are unwilling to do so and will allow the growth of the merchant class."},{"name":"merchant_adventures","bonuses":{"trade_range_modifier":"0.25"},"localizedName":"Merchant Adventures","localizedDesc":"Allows us to make use of the numerous traders lusting for fame and fortune, eager to offer their services for a chance to search and explore new trade routes."},{"name":"national_trade_policy","bonuses":{"trade_efficiency":"0.1"},"localizedName":"National Trade Policy","localizedDesc":"By adopting a national trade policy, we can strengthen our commercial presence and increase the effectiveness of our trade."},{"name":"overseas_merchants","bonuses":{"merchants":"1"},"localizedName":"Overseas Merchants","localizedDesc":"To grow trade we need to extend the rights of citizenship to people who live abroad, support our trade and are of the right social class."},{"name":"trade_manipulation","bonuses":{"trade_steering":"0.25"},"localizedName":"Trade Manipulation","localizedDesc":"At those key choke points where trade could go one way or another, the ability to gain an edge there is key to the growth of our trade income."},{"name":"fast_negotiations","bonuses":{"caravan_power":"0.25"},"localizedName":"Fast Negotiations","localizedDesc":"Sometimes the key to closing a trade deal is to be quickest. We need to ensure that our merchants are able to have the deal done."}],"localizedName":"Trade Ideas"},{"name":"economic_ideas","category":"ADM","ideas":[{"name":"bonus","bonuses":{"development_cost":"-0.2"}},{"name":"bureaucracy","bonuses":{"global_tax_modifier":"0.10"},"localizedName":"Bureaucracy","localizedDesc":"Allows us to increase our tax revenues by adopting a more bureaucratic administrative system governed by state officials."},{"name":"organised_construction","bonuses":{"build_cost":"-0.1"},"localizedName":"Organized Construction","localizedDesc":"The need to upgrade the infrastructure of our government is a costly business, if we structure the process correctly we can do this cheaper."},{"name":"national_bank","bonuses":{"inflation_reduction":"0.1"},"localizedName":"National Bank","localizedDesc":"By establishing a central authority for financial matters, we will have better control over our nation's economy."},{"name":"debt_and_loans","bonuses":{"interest":"-0.5"},"localizedName":"Debt and Loans","localizedDesc":"Debt is sometimes simply unavoidable, however, an organized debt market will allow us to float loans at a lower interest rate."},{"name":"centralization","bonuses":{"global_autonomy":"-0.05"},"localizedName":"Centralization","localizedDesc":"If we centralize the state then we will find it easier to advance the ideas and agenda of the center over the regions."},{"name":"nationalistic_enthusiasm","bonuses":{"land_maintenance_modifier":"-0.05"},"localizedName":"Nationalistic Enthusiasm","localizedDesc":"The supporting of our troops is vital to national defense. With our excellent administration we are able to secure generous discounts for our supplies."},{"name":"smithian_economics","bonuses":{"production_efficiency":"0.1"},"localizedName":"Smithian Economics","localizedDesc":"By opposing mercantilism and restricting the state's influence in economic matters, we shall support a free market that will increase our overall production efficiency."}],"localizedName":"Economic Ideas"},{"name":"exploration_ideas","category":"DIP","ideas":[{"name":"bonus","bonuses":{"cb_on_primitives":"yes"}},{"name":"quest_for_the_new_world","bonuses":{"may_explore":"yes"},"localizedName":"Quest for the New World","localizedDesc":"Allows us to join the number of nations set to explore the world outside of their borders or strive to be the first nation to circumnavigate the world by commencing a quest for the new world."},{"name":"colonial_ventures","bonuses":{"colonists":"1"},"localizedName":"Colonial Ventures","localizedDesc":"Enables us to send more Colonists to uncharted lands."},{"name":"overseas_exploration","bonuses":{"range":"0.5"},"localizedName":"Overseas Exploration","localizedDesc":"Setting up colonies in distant lands is pretty much a one-way trip. If strange new diseases don't get you, the amount of time it takes to sail back means you won't be coming home. If we remind people of the potential riches, we can encourage them to seek lands further afield."},{"name":"land_of_opportunity","bonuses":{"global_colonial_growth":"10"},"localizedName":"Land of Opportunity","localizedDesc":"By portraying colonial lands and new virgin land where any man can make his fortune, possibly some women too, people will emigrate quicker to the colonies. Meaning the nation will have spent less money encouraging people to go there."},{"name":"vice_roys","bonuses":{"global_tariffs":"0.10","envoy_travel_time":"-0.20"},"localizedName":"Viceroys","localizedDesc":"Makes it possible for us to establish Viceroys and thereby improve the administration of our Colonies and increase the amount of money they generate."},{"name":"free_colonies","bonuses":{"expel_minorities_cost":"-1.0"},"localizedName":"Free Colonies","localizedDesc":"Only so many people are willing to move abroad to expand our great colonial empire. However the promise of a plot of land to farm, in free hold, will encourage many more people to seek their fortune abroad. The nice thing about it is that there is plenty of land for everyone."},{"name":"global_empire","bonuses":{"naval_forcelimit_modifier":"0.25"},"localizedName":"Global Empire","localizedDesc":"Our commitment to our colonial empire has changed the attitude of people to jobs in the colonial administration. No longer a place for freebooters who seek to maximize their fortune, instead it is seen as a career for the brightest and the best. This is reflected in our taxes."}],"localizedName":"Exploration Ideas"},{"name":"maritime_ideas","category":"DIP","ideas":[{"name":"bonus","bonuses":{"sea_repair":"yes"}},{"name":"merchant_traditions","bonuses":{"naval_tradition_from_trade":"1.0"},"localizedName":"Merchant Traditions","localizedDesc":"Our nation has a long history of trading at sea with a network of merchants which reach far beyond the horizon. The excellence of our merchant marine and it's daring to sail seas others rather wouldn't is well known."},{"name":"merchant_marine","bonuses":{"global_sailors_modifier":"0.5"},"localizedName":"Merchant Marine","localizedDesc":"Let every merchant ship fly our merchant ensign with pride and know that our navy will always be there to protect them if needs must."},{"name":"sheltered_ports","bonuses":{"global_ship_repair":"0.1","sailor_maintenance_modifer":"-0.1"},"localizedName":"Sheltered Ports","localizedDesc":"It is an unfortunate fact that ships tend to be damaged during battle, and equally unfortunate that the damage is rarely able to be repaired at sea. To alleviate this problem we will create a system of sheltered ports along our coastline where our ships can patch themselves up."},{"name":"grand_navy","bonuses":{"naval_forcelimit_modifier":"0.5"},"localizedName":"Grand Navy","localizedDesc":"Allows us to create one of the largest and most powerful fleets the world has ever seen."},{"name":"ships_penny","bonuses":{"global_ship_cost":"-0.1"},"localizedName":"Ship's Penny","localizedDesc":"Ships are expensive, what we need to do is to get other people to help pay for them. The Ship's penny is a perfect example of this."},{"name":"sea_hawks","bonuses":{"free_leader_pool":"1","admiral_cost":"-0.25"},"localizedName":"Seahawks","localizedDesc":"Allows us to focus heavily on military advancements and thereby increase our naval tradition."},{"name":"naval_fighting_instruction","bonuses":{"blockade_efficiency":"0.5","privateer_efficiency":"0.25"},"localizedName":"Naval Fighting Instruction","localizedDesc":"Allows our naval veterans to devise new methods to improve our fleet's efficiency in blockades."}],"trigger":{"conditions":[{"name":"primitives","value":"no"}],"conditionSets":[]},"localizedName":"Maritime Ideas"},{"name":"quality_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"discipline":"0.05"}},{"name":"private_to_marshal","bonuses":{"infantry_power":"0.1"},"localizedName":"Private to Marshal","localizedDesc":"Every private has a marshal's baton in his back. Well, perhaps not exactly, but for those who distinguish themselves in battle, promotion and rewards will follow. The troops know this and are inspired by it."},{"name":"quality_education","bonuses":{"army_tradition":"0.5"},"localizedName":"Quality Education","localizedDesc":"The most vital moment of any army's existence is straight after a battle. Win or lose, exhausted troops are most vulnerable. We must ensure that our troops are ready for combat before the opposition is."},{"name":"finest_of_horses","bonuses":{"cavalry_power":"0.1"},"localizedName":"Finest of Horses","localizedDesc":"How steadily those troops take the ground! How beautifully those cavalry form! Look at those grey horses! Who are those fine horsemen? These are fine troops."},{"name":"escort_ships","bonuses":{"ship_durability":"0.05"},"localizedName":"Corvettes","localizedDesc":"Corvettes were a class of small warships that were designed to escort friendly vessels and harrass the enemy, relying on speed and maneuverability rather than massed firepower."},{"name":"naval_drill","bonuses":{"naval_morale":"0.10"},"localizedName":"Naval Drill","localizedDesc":"The confusion of combat can leave a warship unfit for action for a long time. A well drilled crew will recover much faster than an ordinary one."},{"name":"copper_bottoms","bonuses":{"naval_attrition":"-0.25"},"localizedName":"Copper Bottoms","localizedDesc":"Wood may be the ideal material for shipbuilding, but it has a tendency to deteriorate over time. By fitting our ships with copper sheathing below the waterline we can reduce this deterioration, allowing them to better withstand long journeys."},{"name":"massed_battery","bonuses":{"artillery_power":"0.1"},"localizedName":"Massed Battery","localizedDesc":"Let us mass our artillery in a single grand battery, its destructive power will blast a hole in the enemy lines."}],"localizedName":"Quality Ideas"},{"name":"quantity_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"land_forcelimit_modifier":"0.50"}},{"name":"mass_army","bonuses":{"global_manpower_modifier":"0.50"},"localizedName":"Levée en Masse","localizedDesc":"We have, up to now, been very choosy over who should serve as a ranker in our military. We only took the poorest and most desperate, basically the people no one else would miss. Now though we are going to open up the ranks to everyone, who isn't rich."},{"name":"the_young_can_serve","bonuses":{"manpower_recovery_speed":"0.20"},"localizedName":"The Young can Serve","localizedDesc":"How old does a boy have to be before he is a man? How old must he be before he can die for his country? Some rulers are squeamish, we on the other hand are an equal opportunity butcher."},{"name":"enforced_service","bonuses":{"global_regiment_cost":"-0.1"},"localizedName":"Enforced Service","localizedDesc":"The principle of volunteering underpins our whole army structure. Sometimes there aren't enough volunteers. We should force people to volunteer."},{"name":"the_old_and_infirm","bonuses":{"land_maintenance_modifier":"-0.05"},"localizedName":"The Old and Infirm","localizedDesc":"The veteran sergeants are some of the most despicable and corrupt men imaginable, but these men are still useful. Rather than leave them to be beggars on our streets, men like this should be used when their service ends. Let's make them into drill sergeants and quartermasters so their unique skills can be put to use."},{"name":"camp_followers","bonuses":{"global_supply_limit_modifier":"0.33"},"localizedName":"Camp Followers","localizedDesc":"Moving through the lands with a force like ours is a large task. Luckily as the army swells so does as well the train of Camp Followers that provide and service the army."},{"name":"garrison_conscription","bonuses":{"garrison_size":"0.25"},"localizedName":"Conscripted Garrisons","localizedDesc":"By conscripting our able young men for our garrisons we can ensure that we have enough men to defend our borders."},{"name":"expanded_supply_trains","bonuses":{"land_attrition":"-0.1"},"localizedName":"Expanded Supply Trains","localizedDesc":"Investing more resources into our supply trains will allow our army to operate for longer periods of time in hostile land."}],"localizedName":"Quantity Ideas"},{"name":"expansion_ideas","category":"ADM","ideas":[{"name":"bonus","bonuses":{"min_autonomy_in_territories":"-0.1"}},{"name":"additional_colonists","bonuses":{"colonists":"1"},"localizedName":"Additional Colonists","localizedDesc":"The new world is many things, most important of all, empty. Well no one important lives there at any rate. By letting people know of the boundless opportunities we have in the new world we will encourage more people to go forth and settle there."},{"name":"additional_merchants","bonuses":{"merchants":"1"},"localizedName":"Additional Merchants","localizedDesc":"Colonies are no good unless we get the produce home to the mother country. We must expand our merchant class to ensure that this happens."},{"name":"faster_colonists","bonuses":{"global_colonial_growth":"20"},"localizedName":"Faster Colonists","localizedDesc":"You cannot simply send colonists out and expect them to build a colony. There is a time-consuming process of preparing the expedition with all the items they will need to survive in their new home. Using past experience, we can speed this process up."},{"name":"factories","bonuses":{"rival_border_fort_maintenance":"-0.5","center_of_trade_upgrade_cost":"-0.2"},"localizedName":"Factories","localizedDesc":"Factories were mostly fortified trading posts settled in offshore coastal areas. These provided safety for both the merchants and the local populace from hostile forces that would disturb our trade."},{"name":"additional_diplomats","bonuses":{"diplomatic_upkeep":"1"},"localizedName":"Additional Diplomats","localizedDesc":"The drive to expand our country means we must also expand our diplomatic reach. We must ensure that our diplomatic service is properly staffed."},{"name":"general_colonization_law","bonuses":{"colonists":"1","colonist_placement_chance":"0.05"},"localizedName":"General Colonization Law","localizedDesc":"By adopting a law allowing free movement of foreign people to our colonies we'll be sure to lure a wider range of future settlers."},{"name":"competetive_merchants","bonuses":{"global_trade_power":"0.2"},"localizedName":"Competitive Merchants","localizedDesc":"To bring trade home we must be able to beat the competition from other countries. We need to ensure that our legal system gives them every possible edge."}],"localizedName":"Expansion Ideas"},{"name":"administrative_ideas","category":"ADM","ideas":[{"name":"bonus","bonuses":{"governing_capacity_modifier":"0.25"}},{"name":"organised_mercenary_payment","bonuses":{"mercenary_cost":"-0.10"},"localizedName":"Organized Mercenary Payments","localizedDesc":"Mercenary captains are a canny lot. They will try to get two commanders in the same army into a bidding war for their services. We will streamline our mercenary recruitment process to prevent abuses by commanders and ensure we are always in the best negotiating position."},{"name":"adaptability","bonuses":{"core_creation":"-0.25"},"localizedName":"Adaptability","localizedDesc":"There is what is ours and what is part of our ancestral domain that will never be surrendered. A bit of flexibility here will see much more land being considered never surrenderable and should the worst happen the whole world will know our crusade to recover it will be just."},{"name":"benefits_for_mercenaries","bonuses":{"merc_maintenance_modifier":"-0.15"},"localizedName":"Benefits for Mercenaries","localizedDesc":"Mercenaries will always look for the best deal, so we need to ensure that mercenaries remain with us. By ensuring we look after our mercenary companies, they will stay loyal for longer and require less direct monetary compensation."},{"name":"bookkeeping","bonuses":{"interest":"-0.5"},"localizedName":"Bookkeeping","localizedDesc":"Sometimes money is short and we need to borrow. Lenders always worry that they will not be paid back. By maintaining meticulous records, we will be able to ensure that everyone gets paid and that will allow us to negotiate lower rates of interest."},{"name":"organised_mercenary_recruitment","bonuses":{"mercenary_manpower":"0.25"},"localizedName":"Mercenary Recruitment","localizedDesc":"Money is not the only limit when it comes to recruiting mercenaries. The other bottleneck is having mercenary companies who actually wish to serve with us. Thus we must ensure our system allows every company to join us."},{"name":"administrative_efficiency_idea","bonuses":{"advisor_pool":"1"},"localizedName":"Administrative Efficiency","localizedDesc":"The most important part of any government is getting the right advice. We must ensure that we are as inclusive as possible when it comes to advisors so we can maximize the number of different viewpoints we are presented with."},{"name":"civil_servants","bonuses":{"adm_tech_cost_modifier":"-0.1"},"localizedName":"Civil Service","localizedDesc":"By establishing a Civil Service of eager young bureaucrats will ensure that we are able to quickly adapt to new advances in administration and governance."}],"localizedName":"Administrative Ideas"},{"name":"humanist_ideas","category":"ADM","ideas":[{"name":"bonus","bonuses":{"idea_cost":"-0.1","yearly_harmony":"0.25","brahmins_muslim_loyalty_modifier":"0.1","dhimmi_loyalty_modifier":"0.1"}},{"name":"tolerance_idea","bonuses":{"religious_unity":"0.25"},"localizedName":"Tolerance","localizedDesc":"Adopting a more tolerant view towards the minority religions in our country will greatly increase our religious unity."},{"name":"local_traditions","bonuses":{"global_unrest":"-2"},"localizedName":"Local Traditions","localizedDesc":"Governing a large nation means ruling over many diverse peoples, each with their own customs and traditions. By incorporating these traditions into our official code of laws we create a happy and loyal populace."},{"name":"ecumenism","bonuses":{"tolerance_heretic":"2"},"localizedName":"Ecumenism","localizedDesc":"The problem with how to deal with heretics in the realm is always difficult. Although the good old-fashioned fire and sword approach will solve most problems eventually, diplomacy can also succeed. By encouraging dialogue between the various sects, we can reduce misunderstanding and promote peace in the realm."},{"name":"indirect_rule","bonuses":{"years_of_nationalism":"-10"},"localizedName":"Indirect Rule","localizedDesc":"Sometimes the best way to get people to do what you want is to let them believe that they're making their own choices. Such a system of indirect rule will reduce the unrest in newly acquired provinces."},{"name":"cultural_ties","bonuses":{"num_accepted_cultures":"2"},"localizedName":"Cultural Ties","localizedDesc":"Different cultures have different customs, and for some reason tend to resist attempts from above to change said customs. We can turn this weakness into a strength by incorporating local leaders into our system of government and having them carry out our will in a way that is palatable to them."},{"name":"benevolence","bonuses":{"improve_relation_modifier":"0.3"},"localizedName":"Benevolence","localizedDesc":"Our nation is a bastion of tolerance and enlightenment. By ensuring that all other nations know this, we can foster better relations abroad."},{"name":"humanist_tolerance","bonuses":{"tolerance_heathen":"2"},"localizedName":"Humanist Tolerance","localizedDesc":"By striving towards a more tolerant society and making attempts at solving our social and religious problems in more rational ways, the risk of civil disorder will diminish."}],"localizedName":"Humanist Ideas"},{"name":"influence_ideas","category":"DIP","ideas":[{"name":"bonus","bonuses":{"unjustified_demands":"-0.5"}},{"name":"tribute_system","bonuses":{"vassal_income":"0.25"},"localizedName":"Tribute System","localizedDesc":"Strengthen our income by establishing a formalized system of yearly tribute from our vassals."},{"name":"additional_loyalist_recruitment","bonuses":{"reduced_liberty_desire":"15"},"localizedName":"Additional Loyalist Recruitment","localizedDesc":"Naturally, there are those who reside in our subjects' lands who understand the divine right of our rule. By recruiting and aiding these enlightened individuals we can strengthen our grasp on subject nations."},{"name":"integrated_elites","bonuses":{"diplomatic_annexation_cost":"-0.25"},"localizedName":"Integrated Elites","localizedDesc":"By bringing the ruling elite of our subject nations into our government we can smoothen the process of integrating their provinces significantly."},{"name":"buffer_states","bonuses":{"diplomatic_upkeep":"1"},"localizedName":"Buffer States","localizedDesc":"To avoid wars between us and a mighty rival, establishing a buffer state between us is not only mutually beneficial but imperative for the stability of the region."},{"name":"diplomatic_influence","bonuses":{"diplomatic_reputation":"2"},"localizedName":"Diplomatic Influence","localizedDesc":"By focusing on Diplomacy we can increase the power we wield on the diplomatic stage. This power can gain us many friends."},{"name":"postal_service","bonuses":{"envoy_travel_time":"-0.25"},"localizedName":"Postal Service","localizedDesc":"With communications being what they are, it is difficult to ensure that our diplomatic dispatches arrive in a timely fashion. Creating a network of post offices and courier rest stops will make it easier for our voice to be heard in distant lands."},{"name":"marcher_lords","bonuses":{"vassal_forcelimit_bonus":"1"},"localizedName":"Marcher Lords","localizedDesc":"By granting considerable autonomy to vassals in border regions, these 'Marcher Lords' will be able to raise large military armies to support us in our wars."}],"localizedName":"Influence Ideas"},{"name":"naval_ideas","category":"MIL","ideas":[{"name":"bonus","bonuses":{"ship_durability":"0.1","allowed_marine_fraction":"0.10"}},{"name":"boarding_parties","bonuses":{"leader_naval_shock":"1"},"localizedName":"Boarding Parties","localizedDesc":"By teaching our naval officers to lead boarding actions against enemy ships, we can gain an edge in naval combat even when fighting superior enemy fleets."},{"name":"improved_rams","bonuses":{"galley_power":"0.25"},"localizedName":"Improved Rams","localizedDesc":"The concept of outfitting warships with rams goes back thousands of years, but great advancements in metallurgy have been made since then and we should take advantage of these to create sturdier rams."},{"name":"naval_cadets","bonuses":{"leader_naval_fire":"1","sunk_ship_morale_hit_recieved":"-0.33"},"localizedName":"Naval Cadets","localizedDesc":"By promoting the navy as the career choice of the nobility's second and third sons, we can create a professional corps of naval officers to oversee our gunnery crews."},{"name":"naval_glory","bonuses":{"navy_tradition":"1"},"localizedName":"Naval Glory","localizedDesc":"The sight of our glorious and prestigious navy will make all adversaries tremble in fear."},{"name":"press_gangs","bonuses":{"sailors_recovery_speed":"0.25"},"localizedName":"Press Gangs","localizedDesc":"Life at sea is hard and unforgiving and not everyone is keen on a career in the Navy. By legalizing the impressment of men of seafaring habits, it will be easier to crew our ships speeding up the process of commissioning ships."},{"name":"oak_forests_for_ships","bonuses":{"heavy_ship_power":"0.20"},"localizedName":"Oak Forests for Ships","localizedDesc":"The more punishment our ships can take the more they can dish out. Let us ensure that we have a ready supply of the finest seasoned oak for our warships."},{"name":"superior_seamanship","bonuses":{"naval_morale":"0.1","global_naval_engagement_modifier":"0.1"},"localizedName":"Superior Seamanship","localizedDesc":"Enables us to transform our fleet into a supreme naval force with high-class vessels and highly skilled captains and sailors."}],"trigger":{"conditions":[{"name":"primitives","value":"no"}],"conditionSets":[]},"localizedName":"Naval Ideas"}]}